Repository: catoblepa/p7mviewer
Catalog: src/locale/*/LC_MESSAGES/io.github.catoblepa.p7mviewer.po
Languages: it

source: 📁 Select file
it: 📁 Seleziona file

source: Select a P7M file to verify
it: Seleziona un file P7M da verificare

source: 📄 View content
it: 📄 Visualizza contenuto

source: Open the original document extracted from the signed file
it: Apri il documento originale estratto dal file firmato

source: No file selected
it: Nessun file selezionato

source: DIGITAL SIGNATURES:
it: FIRME DIGITALI:

source: Select a .p7m file to verify
it: Seleziona un file .p7m da verificare

source: Click on
it: Clicca su

source: Select file
it: Seleziona file

source: to start
it: per cominciare

source: File open error
it: Errore apertura file

source: File not accessible
it: File non accessibile

source: Error
it: Errore

source: Digitally signed files (.p7m)
it: File firmati digitalmente (.p7m)

source: All files
it: Tutti i file

source: File selection error
it: Errore selezione file

source: Verification completed successfully
it: Verifica completata con successo

source: Verification error
it: Errore nella verifica

source: Unknown
it: Sconosciuto

source: Tax Code
it: Codice Fiscale

source: Organization
it: Organizzazione

source: Signature date and time
it: Data e ora firma

source: Signature valid at signing time
it: Firma valida al momento

source: Valid from
it: Validità dal

source: Valid until
it: Validità al

source: Certificate issued by
it: Certificato emesso da

source: No digital signature found in file
it: Nessuna firma digitale trovata nel file

source: signature
it: firma

source: signatures
it: firme

source: Total
it: Totale

source: verified
it: verificata/e

source: Error during signature analysis
it: Errore durante l'analisi delle firme

source: Unable to verify file
it: Impossibile verificare il file

source: The selected file is not a valid P7M file or cannot be processed.
it: Il file selezionato non è un file P7M valido o non può essere processato.

source: File is not in valid P7M/CAdES format
it: Il file non è in formato P7M/CAdES valido

source: Technical details
it: Dettagli tecnici

source: File opening error
it: Errore apertura file

source: Extracted file no longer exists
it: Il file estratto non esiste più

source: No extracted file available
it: Nessun file estratto disponibile

source: Not present
it: Non presente

source: Identity
it: Identità

source: Certificate status
it: Stato certificato

source: Expired
it: Scaduto

source: Not yet valid
it: Non ancora valido

source: Valid
it: Valido

source: Certificate not found for this signature.
it: Certificato non trovato per questa firma.

source: Yes
it: Sì

source: certificate not valid at signature date
it: certificato non valido alla data della firma

source: Usage: python estrai_firme.py file.p7m
it: Uso: python estrai_firme.py file.p7m
